# 执行用时 : 140 ms
# 内存消耗 : 28.8 MB

# 方案：查表


class Solution:
    def isPowerOfThree(self, n: int) -> bool:
        return n in [
            1,
            3,
            9,
            27,
            81,
            243,
            729,
            2187,
            6561,
            19683,
            59049,
            177147,
            531441,
            1594323,
            4782969,
            14348907,
            43046721,
            129140163,
            387420489,
            1162261467,
        ]
